Masmiseim36/nxpSDK/boards/hvpkv11z75m/demo_apps/mc_bldc/pin_mux.h
/*
 * Copyright 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

/*!
 * @brief FTM0 channel 0 output PWM/OCMP mode source select: FTM0CH0 pin is the output of FTM0 channel 0 PWM/OCMP */
#define SOPT8_FTM0OCH0SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 1 output PWM/OCMP mode source select: FTM0CH1 pin is the output of FTM0 channel 1 PWM/OCMP */
#define SOPT8_FTM0OCH1SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 2 output PWM/OCMP mode source select: FTM0CH2 pin is the output of FTM0 channel 2 PWM/OCMP */
#define SOPT8_FTM0OCH2SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 3 output PWM/OCMP mode source select: FTM0CH3 pin is the output of FTM0 channel 3 PWM/OCMP */
#define SOPT8_FTM0OCH3SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 4 output PWM/OCMP mode source select: FTM0CH4 pin is the output of FTM0 channel 4 PWM/OCMP */
#define SOPT8_FTM0OCH4SRC_NO_MODULATION 0x00u
/*!
 * @brief FTM0 channel 5 output PWM/OCMP mode source select: FTM0CH5 pin is the output of FTM0 channel 5 PWM/OCMP */
#define SOPT8_FTM0OCH5SRC_NO_MODULATION 0x00u

/*! @name PORTE25 (number 21), FTM0_CH1
  @{ */
#define PINTOOL_FTM_FTM0_CH1_PORT PORTE /*!<@brief PORT device name: PORTE */
#define PINTOOL_FTM_FTM0_CH1_PIN 25U    /*!<@brief PORTE pin index: 25 */
                                        /* @} */

/*! @name PORTC4 (number 49), FTM0_CH3
  @{ */
#define PINTOOL_FTM_FTM0_CH3_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_FTM_FTM0_CH3_PIN 4U     /*!<@brief PORTC pin index: 4 */
                                        /* @} */

/*! @name PORTC5 (number 50), FTM0_CH2
  @{ */
#define PINTOOL_FTM_FTM0_CH2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define PINTOOL_FTM_FTM0_CH2_PIN 5U     /*!<@brief PORTC pin index: 5 */
                                        /* @} */

/*! @name PORTD4 (number 61), FTM0_CH4
  @{ */
#define PINTOOL_FTM_FTM0_CH4_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_FTM_FTM0_CH4_PIN 4U     /*!<@brief PORTD pin index: 4 */
                                        /* @} */

/*! @name PORTD5 (number 62), FTM0_CH5
  @{ */
#define PINTOOL_FTM_FTM0_CH5_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_FTM_FTM0_CH5_PIN 5U     /*!<@brief PORTD pin index: 5 */
                                        /* @} */

/*! @name PORTE24 (number 20), FTM0_CH0
  @{ */
#define PINTOOL_FTM_FTM0_CH0_PORT PORTE /*!<@brief PORT device name: PORTE */
#define PINTOOL_FTM_FTM0_CH0_PIN 24U    /*!<@brief PORTE pin index: 24 */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_FTM(void);

#define SOPT5_UART1RXSRC_UART_RX 0x00u /*!<@brief UART 1 Receive Data Source Select: UART1_RX pin */
#define SOPT5_UART1TXSRC_UART_TX 0x00u /*!<@brief UART 1 Transmit Data Source Select: UART1_TX pin */

/*! @name PORTD0 (number 57), UART1_RX
  @{ */
#define PINTOOL_UART_UART1_RX_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_UART_UART1_RX_PIN 0U     /*!<@brief PORTD pin index: 0 */
                                         /* @} */

/*! @name PORTD1 (number 58), UART1_TX
  @{ */
#define PINTOOL_UART_UART1_TX_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_UART_UART1_TX_PIN 1U     /*!<@brief PORTD pin index: 1 */
                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_UART(void);

/*! @name PORTA18 (number 32), Relay
  @{ */
#define PINTOOL_MISC_Relay_FGPIO FGPIOA /*!<@brief FGPIO device name: FGPIOA */
#define PINTOOL_MISC_Relay_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define PINTOOL_MISC_Relay_PORT PORTA /*!<@brief PORT device name: PORTA */
#define PINTOOL_MISC_Relay_PIN 18U    /*!<@brief PORTA pin index: 18 */
                                      /* @} */

/*! @name PORTD2 (number 59), USER_LED
  @{ */
#define PINTOOL_MISC_USER_LED_FGPIO FGPIOD /*!<@brief FGPIO device name: FGPIOD */
#define PINTOOL_MISC_USER_LED_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define PINTOOL_MISC_USER_LED_PORT PORTD /*!<@brief PORT device name: PORTD */
#define PINTOOL_MISC_USER_LED_PIN 2U     /*!<@brief PORTD pin index: 2 */
                                         /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void PinTool_Misc(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
